In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../fortune500.csv')

In [3]:
df

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
...,...,...,...,...,...
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [4]:
pd.set_option("display.max_columns", 3)

In [5]:
df.head()

   Year  ...  Profit (in millions)
0  1955  ...                   806
1  1955  ...                 584.8
2  1955  ...                 195.4
3  1955  ...                 212.6
4  1955  ...                  19.1

[5 rows x 5 columns]

In [6]:
df.head(10)

   Year  ...  Profit (in millions)
0  1955  ...                   806
1  1955  ...                 584.8
2  1955  ...                 195.4
3  1955  ...                 212.6
4  1955  ...                  19.1
5  1955  ...                  18.5
6  1955  ...                   1.6
7  1955  ...                 182.8
8  1955  ...                 183.8
9  1955  ...                 344.4

[10 rows x 5 columns]

In [7]:
df.tail(20)

       Year  ...  Profit (in millions)
25480  2005  ...                 215.6
25481  2005  ...                -181.9
25482  2005  ...                 192.4
25483  2005  ...                 111.6
25484  2005  ...                   524
25485  2005  ...                  N.A.
25486  2005  ...                   188
25487  2005  ...                 331.2
25488  2005  ...                  64.9
25489  2005  ...                    49
25490  2005  ...                  -458
25491  2005  ...                   154
25492  2005  ...                  71.8
25493  2005  ...                   328
25494  2005  ...                -567.6
25495  2005  ...                   493
25496  2005  ...                 175.4
25497  2005  ...                  57.8
25498  2005  ...                  70.6
25499  2005  ...                   584

[20 rows x 5 columns]

In [8]:
df["Company"]

0               General Motors
1                  Exxon Mobil
2                   U.S. Steel
3             General Electric
4                       Esmark
                 ...
25495          Wm. Wrigley Jr.
25496           Peabody Energy
25497    Wendy's International
25498       Kindred Healthcare
25499     Cincinnati Financial
Name: Company, Length: 25500, dtype: object

In [9]:
df[["Rank", "Company"]]

       Rank                Company
0         1         General Motors
1         2            Exxon Mobil
2         3             U.S. Steel
3         4       General Electric
4         5                 Esmark
...     ...                    ...
25495   496        Wm. Wrigley Jr.
25496   497         Peabody Energy
25497   498  Wendy's International
25498   499     Kindred Healthcare
25499   500   Cincinnati Financial

[25500 rows x 2 columns]

In [10]:
type(df[["Rank", "Company"]])

pandas.core.frame.DataFrame

In [11]:
person = { 
    "first" : "Kwang IL",
    "last" : "Kim",
    "eamil" : "kki4504@gmail.com"
}

In [12]:
people = {
    "first" : ["Kwang IL"],
    "last" : ["Kim"],
    "email" : ["kki4504@gmail.com"]
}

In [13]:
print(person)

{'first': 'Kwang IL', 'last': 'Kim', 'eamil': 'kki4504@gmail.com'}

In [14]:
print(people)

{'first': ['Kwang IL'], 'last': ['Kim'], 'email': ['kki4504@gmail.com']}

In [15]:
people = {
    "first" : ["Kwang IL", "Pang IL", "Bom"],
    "last" : ["Kim", "Kim", "Jung"],
    "email" : ["kki4504@gmail.com", "Pangil@gmail.com", "bom@naver.com"]
}

In [16]:
people['first']

['Kwang IL', 'Pang IL', 'Bom']

In [17]:
people.first

AttributeError: 'dict' object has no attribute 'first'

In [18]:
people['first'][1]

'Pang IL'

In [19]:
df = pd.DataFrame(people);

In [20]:
df

      first  last              email
0  Kwang IL   Kim  kki4504@gmail.com
1   Pang IL   Kim   Pangil@gmail.com
2       Bom  Jung      bom@naver.com

In [21]:
df.email

0    kki4504@gmail.com
1     Pangil@gmail.com
2        bom@naver.com
Name: email, dtype: object

In [22]:
df['email']

0    kki4504@gmail.com
1     Pangil@gmail.com
2        bom@naver.com
Name: email, dtype: object

In [23]:
df[['last', 'email']]

   last              email
0   Kim  kki4504@gmail.com
1   Kim   Pangil@gmail.com
2  Jung      bom@naver.com

In [24]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

loc, iloc을 사용해 특정 행과열을 인출할 수 있다.

In [30]:
df.loc[[0]]

      first last              email
0  Kwang IL  Kim  kki4504@gmail.com

In [31]:
df

      first  last              email
0  Kwang IL   Kim  kki4504@gmail.com
1   Pang IL   Kim   Pangil@gmail.com
2       Bom  Jung      bom@naver.com

In [25]:
df.iloc[0]

first             Kwang IL
last                   Kim
email    kki4504@gmail.com
Name: 0, dtype: object

In [26]:
df.iloc[[0 , 1]]

      first last              email
0  Kwang IL  Kim  kki4504@gmail.com
1   Pang IL  Kim   Pangil@gmail.com

In [27]:
df.iloc[[0, 1], 2]

0    kki4504@gmail.com
1     Pangil@gmail.com
Name: email, dtype: object